segfaultlabs/ESP32_GPS_Clock/ESP32_GPS_Clock.cpp
#include <Arduino.h>
#include <TinyGPS++.h>
#include <HardwareSerial.h>
// Servo Support
#include <ESP32Servo.h>
// OLED Support
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <Wire.h>
#include <TimeLib.h>
#define LED_PIN 2
// ToDo 
// Build Serial menu for interacitons, servo control angel setting etc 
// passthrough NEMA, formatted NEMA, Drift checks of time, location, speed, abilty to configure timezone hardcoded,

// set up the hardware

// Servo Setup
// Define Servo objects
Servo servoHourTens;
Servo servoHourOnes;
Servo servoMinuteTens;
Servo servoMinuteOnes;
Servo servoSecondTens;
Servo servoSecondOnes;

// Define pin numbers for each servo
const int pinHourTens = 26;   // GPIO15, corresponds to D15
const int pinHourOnes = 27;    // GPIO2, corresponds to D2
const int pinMinuteTens = 19;  // GPIO4, corresponds to D4
const int pinMinuteOnes = 14; // GPIO16, corresponds to D4
const int pinSecondTens = 15;  // Choose an available GPIO, example GPIO32
const int pinSecondOnes = 4;  // Choose an available GPIO, example GPIO33

// Configuration for servo update frequency
//unsigned long servoUpdateInterval = 1000; // Default to 1000 ms
//unsigned long lastServoUpdate = 0;

// Arrays to hold angle configurations for each digit (0-9)
// 7Segment Number        0, 1,  2,  3,  4,  5,   6,   7,   8,   9
int anglesHourTens[10] = {0, 20, 40, 60, 80, 100, 120, 140, 160, 180};
int anglesHourOnes[10] = {0, 20, 40, 60, 80, 100, 120, 140, 160, 180};
// 7Segment Number          0, 1,  2,  3,  4,  5,   6,   7,   8,   9
int anglesMinuteTens[10] = {0, 20, 40, 60, 80, 100, 0, 0, 0, 0};
int anglesMinuteOnes[10] = {0, 20, 40, 60, 80, 100, 120, 140, 160, 180};
// 7Segment Number          0, 1,  2,  3,  4,  5,   6,   7,   8,   9
int anglesSecondTens[10] = {0, 22, 43, 58, 77, 94, 0, 0, 0, 0};
int anglesSecondOnes[10] = {0, 22, 43, 58, 77, 95, 112, 134, 147, 170};
// int anglesSecondTens[10] = {0, 20, 40, 60, 80, 100, 120, 140, 160, 180};
// int anglesSecondOnes[10] = {0, 20, 40, 60, 80, 100, 120, 140, 160, 180};

// Presence detection
//bool presenceDetected = true; // Default to true for initial testing
//unsigned long lastPresenceTime = 0;
//unsigned long presenceTimeout = 30000; // 30 seconds without human presence before disabling servo movement

// OLED support
#define SCREEN_WIDTH 128  // OLED display width, in pixels
#define SCREEN_HEIGHT 64  // OLED display height, in pixels

// SPI OLED display connections using specified GPIOs of ESP32
#define OLED_MOSI 23   // Master Out Slave In, corresponding to D1
#define OLED_CLK 18    // Serial Clock, corresponding to D0
#define OLED_DC 21     // Data/Command, corresponding to DC
#define OLED_CS 5      // Chip Select, corresponding to CS
#define OLED_RESET 22  // Reset, corresponding to RES

// Initialize Adafruit SSD1306 OLED display
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, OLED_MOSI, OLED_CLK, OLED_DC, OLED_RESET, OLED_CS);

// GPS Setup 
HardwareSerial gpsSerial(1);  // GPS Module connected to UART1
TinyGPSPlus gps;              // Create a GPS object

//set up the variables
unsigned long lastSyncTime = 0;
unsigned long bootTime = 0;
int displayPage = 0;
int ledState = LOW;  // Initialize LED state variable, assuming LED is initially off
bool hasGPSFix = false;
int timezoneOffset = 0;              // Global variable to store the timezone offset
bool timezoneOffsetUpdated = false;  // Flag to check if the timezone offset needs to be updated
bool servoUpdateEnabled = true;  // Set true to enable, false to disable servo updates

// Debug you say?
bool debugEnabled = false;  // Set to false to disable debug output

// Set up a variable to contain a NEMA sentance
String latestNMEA = "";  // Holds the latest NMEA sentence received from the GPS

// set up the counters
const unsigned long GPSUpdateInterval = 100;  // Time to update the internal clock from the GPS, we can do this all the time if we want
const unsigned long timeUpdateInterval = 1000;  // Timeon the screen updates every 1000 milliseconds (1 second)
const unsigned long gpsDataPublishInterval = 5000;      // Set interval for publishing GPS data on the USB serial line, e.g., 5000 milliseconds (5 seconds)
const unsigned long serialDataPublishInterval = 1000;  // set interval for publishing genral diagonstics device data on USB serial line
const unsigned long timeZoneUpdateInterval = 600000;     // set interval for updating the TimeZone based off latitude and logitude.
const unsigned long servoUpdateInterval = 1000;  // Servo update frequency in milliseconds

// set up the icon locations
// Calling the function with specific positions for the satellite icon and signal bars
int satelliteIconX = 0;  // X coordinate for the satellite icon
int satelliteIconY = 0;  // Y coordinate for the satellite icon
int barsX = 105;         // X coordinate for the top-right position of the signal bars
int barsY = 14;          // Y coordinate for the top-right position of the signal bars (just below the time)
int gpsDataStartY = 25;  // Default starting position for GPS data
int mainRX_X = 104;      // X position for RX icon
int mainRX_Y = 0;        // Y position for RX icon

// GPS settings 
bool isReceivingGPSData = false;     // Flag to indicate receiving data
unsigned long lastGPSDataTime = 0;   // Last time GPS data was received
unsigned long flashInterval = 1000;  // Interval for flashing "RX"
bool showRX = true;                  // Whether to show "RX" or not
unsigned long lastRXOnTime = 0;      // Track when RX was last turned on

void setup() {
  Serial.begin(115200);                       // Start the serial connection to the computer
  gpsSerial.begin(9600, SERIAL_8N1, 16, 17);  // Start gpsSerial communication
  pinMode(2, OUTPUT);                         // ESP32 Onboard LED set as an output
  bootTime = millis();                        // Record the time when the system started
  setSyncProvider(getGPS);                    // Set the function used to get time from GPS
  // Attach servos to their respective GPIO pins 
  servoHourTens.attach(pinHourTens);          // Servo for tens of hours
  servoHourOnes.attach(pinHourOnes);          // Servo for ones of hours
  servoMinuteTens.attach(pinMinuteTens);      // Servo for tens of minutes
  servoMinuteOnes.attach(pinMinuteOnes);      // Servo for ones of minutes
  servoSecondTens.attach(pinSecondTens);      // Servo for tens of seconds
  servoSecondOnes.attach(pinSecondOnes);      // Servo for ones of seconds

  // Initialize the OLED display
  if (!display.begin(SSD1306_SWITCHCAPVCC)) {
    Serial.println(F("SSD1306 allocation failed"));
    for (;;)
      ;  // Don't proceed, loop forever
  }
  display.display();  // Show initial display buffer contents on the screen -- the library initializes this with an Adafruit splash screen.
  //delay(200);              // Pause for 2 seconds
  display.clearDisplay();  // Clear the buffer
}

void loop() {
  static unsigned long lastGPSUpdate = 0;
  static unsigned long lastSecondUpdate = 0;
  static unsigned long lastGPSDataPublish = 0;
  static unsigned long lastSerialDataPublish = 0;
  static unsigned long lastTimezoneUpdate = 0;
  static unsigned long lastDataReceivedTime = 0;  // Track the last time data was received
  static unsigned long lastServoUpdate = 0;  // Last time servos were updated

  debugPrint("Entering loop...");

  // Process available data from GPS
  if (millis() - lastGPSUpdate >= GPSUpdateInterval) {
    lastGPSUpdate = millis();
    bool dataReceived = false;
    while (gpsSerial.available() > 0) {
      char c = gpsSerial.read();
      latestNMEA += c;  // Append the read character to the latest NMEA string
      if (gps.encode(c)) {
        if (gps.location.isValid() && gps.time.isValid()) {
          hasGPSFix = true;
          setTime(getGPS());  // Set system time with GPS time
          adjustTimeZone();   // Adjust system time for local timezone
          debugPrint("GPS fix and time updated.");
        } else {
          hasGPSFix = false;
        }
      }
      if (c == '\n') {
        debugPrint(latestNMEA);  // Print the full NMEA sentence to Serial Monitor
        latestNMEA = "";             // Reset latestNMEA after printing
      }
      dataReceived = true;
    }

