segfaultlabs/ESP32_GPS_Clock/ESP32_GPS_Clock.cpp
    if (dataReceived) {
      lastDataReceivedTime = millis();            // Update the last data received time
      manageRXDisplay(mainRX_X, mainRX_Y, true);  // Update RX display to show data is being received
      ledState = HIGH;                            // Turn LED ON to indicate data reception
    } else if (millis() - lastDataReceivedTime > flashInterval) {
      manageRXDisplay(mainRX_X, mainRX_Y, false);  // Update RX display to show no data received
      ledState = LOW;                              // Turn LED OFF if no data is received
    }
    digitalWrite(LED_PIN, ledState);
  }

  // Update time display every second
  if (millis() - lastSecondUpdate >= timeUpdateInterval) {
    lastSecondUpdate = millis();
    debugPrint("Updating time display...");
    displayTimeAndDate(satelliteIconX, satelliteIconY, barsX, barsY, mainRX_X, mainRX_Y);
    //}
  }

  // Update servo positions based on the specified interval
  if (millis() - lastServoUpdate >= servoUpdateInterval) {
    lastServoUpdate = millis();
    updateServoPositions();  // Update servo positions to current time
  }

  // Publish GPS data on a separate timer
  if (millis() - lastGPSDataPublish >= gpsDataPublishInterval) {
    lastGPSDataPublish = millis();
    publishGPSData();  // Publish GPS data to serial port
  }

  // Send data via serial on its own timer
  if (millis() - lastSerialDataPublish >= serialDataPublishInterval) {
    // lastSerialDataPublish = millis();
    debugPrint("Publishing GPS data on USB serial");
    sendDataViaSerial();  // Send the current time to USB serial
  }

  // Recalculate timezone incase device is moved between timezones.
  if (millis() - lastTimezoneUpdate >= timeZoneUpdateInterval) {
    lastTimezoneUpdate = millis();
    if (gps.location.isValid() && gps.time.isValid()) {
      debugPrint("Recalculating timezone...");
      timezoneOffsetUpdated = false;  // Reset the flag to indicate timezone needs updating
      adjustTimeZone();               // Recalculate the timezone using the latest GPS data
    }
  }
  //ledState = LOW;
  //digitalWrite(LED_PIN, ledState);

  delay(20);  // Short delay to reduce CPU usage
}

void updateServoPositions() {
      if (!servoUpdateEnabled) {
        return;  // Exit the function early if servo updates are disabled
    }
    // Renamed variables for clarity
    int currentServoHour = hourFormat12();   // Get 12-hour format hour
    int currentServoMinute = minute();       // Get minutes
    int currentServoSecond = second();       // Get seconds

    // Compute the tens and ones for hour, minutes, and seconds
    int hourTens = currentServoHour / 10;
    int hourOnes = currentServoHour % 10;
    int minuteTens = currentServoMinute / 10;
    int minuteOnes = currentServoMinute % 10;
    int secondTens = currentServoSecond / 10;
    int secondOnes = currentServoSecond % 10;

    // Debugging: Print the current time components
    if (debugEnabled) {
        debugPrint("Current Time: " + String(currentServoHour) + ":" + String(currentServoMinute) + ":" + String(currentServoSecond));
        debugPrint("Hour Tens: " + String(hourTens) + " Hour Ones: " + String(hourOnes));
        debugPrint("Minute Tens: " + String(minuteTens) + " Minute Ones: " + String(minuteOnes));
        debugPrint("Second Tens: " + String(secondTens) + " Second Ones: " + String(secondOnes));
    }

    // Write the calculated angles to each servo
    servoHourTens.write(anglesHourTens[hourTens]);
    servoHourOnes.write(anglesHourOnes[hourOnes]);
    servoMinuteTens.write(anglesMinuteTens[minuteTens]);
    servoMinuteOnes.write(anglesMinuteOnes[minuteOnes]);
    servoSecondTens.write(anglesSecondTens[secondTens]);
    servoSecondOnes.write(anglesSecondOnes[secondOnes]);

    // Debugging: Print the angles set on each servo
    if (debugEnabled) {
        debugPrint("Setting Hour Tens Servo to " + String(anglesHourTens[hourTens]) + " degrees");
        debugPrint("Setting Hour Ones Servo to " + String(anglesHourOnes[hourOnes]) + " degrees");
        debugPrint("Setting Minute Tens Servo to " + String(anglesMinuteTens[minuteTens]) + " degrees");
        debugPrint("Setting Minute Ones Servo to " + String(anglesMinuteOnes[minuteOnes]) + " degrees");
        debugPrint("Setting Second Tens Servo to " + String(anglesSecondTens[secondTens]) + " degrees");
        debugPrint("Setting Second Ones Servo to " + String(anglesSecondOnes[secondOnes]) + " degrees");
    }
}

// helper function to deploy debugs
void debugPrint(const String& message) {
  if (debugEnabled) {
    Serial.println(message);
  }
}

void sendDataViaSerial() {
  // Send the current timestamp, Hall sensor value, and internal temperature to the USB serial in a single statement
  // Serial.printf("Timestamp: %lu, Hall Sensor: %d, Internal Temp: %.2f°C\n", now(), hallRead(), temperatureRead());
}

/**
 * @brief Retrieves the current GPS time and converts it into a time_t format.
 *
 * This function checks if the time from the GPS module is valid. If it is,
 * the function constructs a time structure (tmElements_t) from the received
 * GPS time data and converts this structure into a time_t value. The time_t
 * value represents the number of seconds since January 1, 1970 (the Unix epoch).
 * This time format is commonly used in many computing systems for time operations.
 *
 * @return time_t The current time as a Unix epoch time if the GPS time is valid,
 *                or 0 if the GPS time is invalid.
 */
time_t getGPS() {
  // Check if the time reported by the GPS is valid
  if (gps.time.isValid()) {
    // Create a structure to hold the time elements
    tmElements_t tm;

    // Populate the time structure with time information from the GPS
    tm.Hour = gps.time.hour();      // Set the hour
    tm.Minute = gps.time.minute();  // Set the minute
    tm.Second = gps.time.second();  // Set the second
    tm.Day = gps.date.day();        // Set the day of the month
    tm.Month = gps.date.month();    // Set the month

