segfaultlabs/ESP32_GPS_Clock/ESP32_GPS_Clock.cpp
    // Convert the year from the GPS (which is a full four-digit year)
    // to a year offset from 1970, as required by the TimeLib.h functions.
    tm.Year = CalendarYrToTm(gps.date.year());

    // Convert the tm structure to a time_t value (number of seconds since the Unix epoch)
    return makeTime(tm);
  } else {
    // If the GPS time is not valid, return 0
    return 0;
  }
}

/**
 * @brief Displays the current time and date on an LCD screen.
 *
 * This function formats the current system time and date into a human-readable string
 * and displays it on an LCD. The time is displayed in the format "HH:MM:SS" and the date
 * in the format "DD/MM", where HH is hours, MM is minutes, SS is seconds, DD is day, and
 * MM is month. This function assumes that the system time has been previously set and
 * is maintained accurately (e.g., via an NTP server, RTC, or GPS time sync).
 */

void displayTimeAndDate(int satelliteIconX, int satelliteIconY, int barsX, int barsY, int rxX, int rxY) {
  static unsigned long lastUpdate = 0;
  unsigned long currentMillis = millis();
  if (currentMillis - lastUpdate > 500) {  // Update the display every second
    lastUpdate = currentMillis;

    display.clearDisplay();
    display.setTextSize(2);  // Larger text size for time
    display.setTextColor(SSD1306_WHITE);

    // Create time string
    char timeBuffer[20];
    sprintf(timeBuffer, "%02d:%02d:%02d", hour(), minute(), second());

    // Position and display time
    display.setCursor(0, 0);  // Position time at the top left
    display.println(timeBuffer);

    // Create date string with smaller font
    char dateBuffer[20];
    sprintf(dateBuffer, "%02d/%02d/%04d", day(), month(), year());
    display.setTextSize(1);    // Smaller text size for date
    display.setCursor(0, 16);  // Position below time
    display.println(dateBuffer);

    // Draw the signal bar at a configurable position
    displaySignalBar(barsX, barsY);

    // Additional GPS data display
    displayAllGPSData();

    display.display();  // Update the display with the new data
  }
}

void displaySignalBar(int xStart, int yStart) {
  static unsigned long lastToggle = 0;
  static bool showBars = true;
  unsigned long currentMillis = millis();

  float hdop = gps.hdop.hdop();
  int bars = 0;

  // Define bars based on HDOP
  if (hdop == 0.0) bars = 1;
  else if (hdop < 1.0) bars = 5;
  else if (hdop < 2.0) bars = 4;
  else if (hdop < 5.0) bars = 3;
  else if (hdop < 10.0) bars = 2;
  else if (hdop >= 10.0) bars = 1;

  if (hdop > 5.0) {
    if (currentMillis - lastToggle > 500) {
      showBars = !showBars;
      lastToggle = currentMillis;
    }
  } else {
    showBars = true;
  }

  int barWidth = 3;

  if (showBars) {
    for (int i = 0; i < bars; i++) {
      int barHeight = 2 + i * 3;
      display.fillRect(xStart + i * 6, yStart - barHeight, barWidth, barHeight, SSD1306_WHITE);
    }
  }
}

void manageRXDisplay(int rxX, int rxY, bool show) {
  display.setCursor(rxX, rxY);
  if (show) {
    display.print("RX");
  } else {
    display.print("  ");  // Print spaces to clear the "RX"
  }
  display.display();  // Ensure to update the display after changing content
}

/**
 * @brief Adjusts the system time based on the local time zone calculated from GPS coordinates.
 * 
 * This function calculates the local time zone offset based on the longitude obtained from the GPS location.
 * It then adjusts the current system time by adding the time zone offset to the UTC time obtained from the GPS.
 * The adjusted time is set using the setTime function provided by the TimeLib.h library.
 * 
 * Note: This function assumes that the GPS location and time data are valid.
 */

void adjustTimeZone() {
  if (gps.location.isValid() && gps.time.isValid()) {
    if (!timezoneOffsetUpdated) {
      timezoneOffset = calculateTimeZoneOffset(gps.location.lat(), gps.location.lng());
      timezoneOffsetUpdated = true;  // Mark the timezone as updated
    }
    // Get the current UTC time from GPS data
    time_t utc = getGPS();
    // Convert UTC to local time based on the stored timezone offset
    time_t localTime = utc + timezoneOffset * SECS_PER_HOUR;  // SECS_PER_HOUR is 3600
    // Apply the local time
    setTime(localTime);
    // Optionally, print the adjusted time for verification
    // debugPrint("Adjusted Time: ");
    // debugPrint(localTime());
  } else {
    Serial.println("GPS data not valid, cannot adjust timezone.");
    timezoneOffsetUpdated = false;  // Reset the update flag if GPS data is not valid
  }
}

int calculateTimeZoneOffset(float latitude, float longitude) {
  Serial.print("Calculating timezone for coordinates: Latitude = ");
  Serial.print(latitude, 6);  // 6 decimal places for precision
  Serial.print(", Longitude = ");
  Serial.println(longitude, 6);

  // Implement specific checks for known exceptions
  // Example: India
  if (longitude > 68.0f && longitude < 97.0f && latitude > 8.0f && latitude < 37.0f) {
    Serial.println("Location is in India, applying UTC +5.5");
    return 5.5;  // UTC + 5:30
  }
  // Example: Newfoundland
  if (longitude > -59.0f && longitude < -52.0f && latitude > 46.0f && latitude < 61.0f) {
    Serial.println("Location is in Newfoundland, applying UTC -3.5");
    return -3.5;  // UTC - 3:30
  }
  // Explicit handling for Korean Peninsula
  if ((longitude >= 124.0f && longitude <= 131.0f) && (latitude >= 33.0f && latitude <= 43.0f)) {
    Serial.println("Location is on the Korean Peninsula, applying UTC +9");
    return 9;  // UTC +9 for both South Korea and North Korea
  }
  // Default calculation
  int calculatedTimeZone = round(longitude / 15.0);
  Serial.print("Location does not match specific exceptions, calculated timezone using default method: UTC ");
  Serial.println(calculatedTimeZone);
  return calculatedTimeZone;
}

// Helper function to print time_t in human-readable form
void printTime(time_t t) {
  char buffer[30];  // Buffer to hold the formatted time string
  sprintf(buffer, "%02d:%02d:%02d %02d/%02d/%04d\n",
          hour(t), minute(t), second(t), day(t), month(t), year(t));
  debugPrint(buffer);
}

/**
 * @brief Horizontal Dilution of Precision (HDOP) is a measure of the satellite geometry affecting GPS accuracy,
 * specifically in the horizontal plane.
 * Mathematically, HDOP is calculated as the ratio of the positional uncertainty in the horizontal plane to the theoretical minimum 
 * uncertainty achievable with the same number of satellites in optimal positions. 
 * A lower HDOP value indicates better geometric satellite distribution and, consequently, better position accuracy.
 * 
 * In practical terms, a typical HDOP value ranges from 1 to 10, with lower values indicating higher accuracy. 
 * A HDOP value below 1.0 is considered excellent, while values above 5.0 may result in significant position errors. 
 * HDOP values significantly above 10.0 indicate poor satellite geometry and may render the GPS position fix unreliable.
 */
String hdopDescription(float hdop) {
  if (hdop < 2.0) return "Perfect";
  if (hdop < 5.0) return "Good";
  if (hdop < 7.0) return "OK";
  if (hdop < 10.0) return "Poor";
  return "BAD!";
}

void displayAllGPSData() {
  display.setTextSize(1);               // Set text size for more data on the screen
  display.setTextColor(SSD1306_WHITE);  // Set text color

  int yPos = gpsDataStartY;  // Use the global variable for the start position
  int lineSpacing = 8;       // Space between lines

