segfaultlabs/ESP32_GPS_Clock/ESP32_GPS_Clock.cpp
  // Check if the GPS fix is valid
  if (hasGPSFix && gps.location.isValid() && gps.altitude.isValid() && gps.satellites.isValid()) {
    // Display each piece of information on a new line
    display.setCursor(0, yPos);
    display.println("Altitude: " + String(gps.altitude.meters()) + "m");

    display.setCursor(0, yPos + lineSpacing * 1);
    display.println("Satellites: " + String(gps.satellites.value()));

    display.setCursor(0, yPos + lineSpacing * 2);
    display.println("Lat: " + String(gps.location.lat(), 6));

    display.setCursor(0, yPos + lineSpacing * 3);
    display.println("Long: " + String(gps.location.lng(), 6));

    display.setCursor(0, yPos + lineSpacing * 4);
    display.println("UTC Offset: " + String(timezoneOffset));
  } else {
    // Display zeros when GPS data is not valid
    display.setCursor(0, yPos);
    display.println("Altitude: 0m");

    display.setCursor(0, yPos + lineSpacing * 1);
    display.println("Satellites: 0");

    display.setCursor(0, yPos + lineSpacing * 2);
    display.println("Lat: 0.000000");

    display.setCursor(0, yPos + lineSpacing * 3);
    display.println("Long: 0.000000");

    display.setCursor(0, yPos + lineSpacing * 4);
    display.println("UTC Offset: 0");
  }

  display.display();
}

//
// void loop() {
//   // Existing code...

//   // Check for presence and update time
//   if (millis() - lastPresenceTime <= presenceTimeout) {
//     presenceDetected = true;
//   } else {
//     presenceDetected = false;
//   }

//   // Update servo positions based on time interval and presence detection
//   if (presenceDetected && millis() - lastServoUpdate >= servoUpdateInterval) {
//     lastServoUpdate = millis();
//     updateServoPositions(); // Update servo positions to current time
//   }

//   // Existing code...
// }


// void checkPresence() {
//   // Example of manual presence checking
//   // Later replace with sensor input
//   if (digitalRead(PIR_PIN) == HIGH) { // Assuming PIR_PIN is defined where your PIR sensor is connected
//     lastPresenceTime = millis();
//   }
// }

// push data to serial,
void publishGPSData() {
  Serial.println("Detailed GPS Data:");
  Serial.print("Latitude: ");
  Serial.println(gps.location.lat(), 6);
  Serial.print("Longitude: ");
  Serial.println(gps.location.lng(), 6);
  Serial.print("Altitude: ");
  Serial.println(gps.altitude.meters());
  Serial.print("Satellites: ");
  Serial.println(gps.satellites.value());
  Serial.print("HDOP: ");
  Serial.println(gps.hdop.hdop());
  Serial.print("Date: ");
  Serial.print(month());
  Serial.print("/");
  Serial.print(day());
  Serial.print("/");
  Serial.println(year() % 100);
  Serial.print("Time: ");
  Serial.print(hour());
  Serial.print(":");
  Serial.print(minute());
  Serial.print(":");
  Serial.println(second());
  Serial.print("Speed: ");
  Serial.println(gps.speed.kmph());
  Serial.println("---------------------");
}
